In [1]:
import pandas as pd
import numpy as np

https://stackoverflow.com/questions/34304649/iterate-date-range-using-python-pandas

<pre><code>     ID        ArCityArCountry      DptCityDptCountry  EndDate StartDate
0  1922            ParisFrance     NewYorkUnitedState  3/10/08    2/2/01
1  1002  LosAngelesUnitedState      ForidaUnitedState  3/10/08   12/1/08
2  1901            ParisFrance           LagosNigeria   3/5/01    2/2/01
3  1922            ParisFrance     NewYorkUnitedState   2/3/11   12/1/08
4  1002            ParisFrance  CaliforniaUnitedState   3/4/03    3/4/02
5  1099            ParisFrance           BeijingChina   2/3/11    2/4/09
6  1901  LosAngelesUnitedState            ParisFrance   3/5/01    2/2/01
</code></pre>

In [57]:
df = pd.read_clipboard()

In [58]:
df

     ID        ArCityArCountry      DptCityDptCountry  EndDate StartDate
0  1922            ParisFrance     NewYorkUnitedState  3/10/08    2/2/01
1  1002  LosAngelesUnitedState      ForidaUnitedState  3/10/08   12/1/08
2  1901            ParisFrance           LagosNigeria   3/5/01    2/2/01
3  1922            ParisFrance     NewYorkUnitedState   2/3/11   12/1/08
4  1002            ParisFrance  CaliforniaUnitedState   3/4/03    3/4/02
5  1099            ParisFrance           BeijingChina   2/3/11    2/4/09
6  1901  LosAngelesUnitedState            ParisFrance   3/5/01    2/2/01

In [59]:
df.EndDate = pd.to_datetime(df.EndDate)
df.StartDate = pd.to_datetime(df.StartDate)
df = df.set_index('StartDate')

In [60]:
df

              ID        ArCityArCountry      DptCityDptCountry    EndDate
StartDate
2001-02-02  1922            ParisFrance     NewYorkUnitedState 2008-03-10
2008-12-01  1002  LosAngelesUnitedState      ForidaUnitedState 2008-03-10
2001-02-02  1901            ParisFrance           LagosNigeria 2001-03-05
2008-12-01  1922            ParisFrance     NewYorkUnitedState 2011-02-03
2002-03-04  1002            ParisFrance  CaliforniaUnitedState 2003-03-04
2009-02-04  1099            ParisFrance           BeijingChina 2011-02-03
2001-02-02  1901  LosAngelesUnitedState            ParisFrance 2001-03-05

In [61]:
new_df = pd.DataFrame()

In [62]:
for i, data in df.iterrows():

    print data.to_frame().transpose()

              ID ArCityArCountry   DptCityDptCountry              EndDate
2001-02-02  1922     ParisFrance  NewYorkUnitedState  2008-03-10 00:00:00
              ID        ArCityArCountry  DptCityDptCountry  \
2008-12-01  1002  LosAngelesUnitedState  ForidaUnitedState

                        EndDate
2008-12-01  2008-03-10 00:00:00
              ID ArCityArCountry DptCityDptCountry              EndDate
2001-02-02  1901     ParisFrance      LagosNigeria  2001-03-05 00:00:00
              ID ArCityArCountry   DptCityDptCountry              EndDate
2008-12-01  1922     ParisFrance  NewYorkUnitedState  2011-02-03 00:00:00
              ID ArCityArCountry      DptCityDptCountry              EndDate
2002-03-04  1002     ParisFrance  CaliforniaUnitedState  2003-03-04 00:00:00
              ID ArCityArCountry DptCityDptCountry              EndDate
2009-02-04  1099     ParisFrance      BeijingChina  2011-02-03 00:00:00
              ID        ArCityArCountry DptCityDptCountry              EndDate
2001-02-02  1901  LosAngelesUnitedState       ParisFrance  2001-03-05 00:00:00

In [63]:
for i, data in df.iterrows():
    data = data.to_frame().transpose()
    data = data.reindex(pd.date_range(start=data.index[0], end=data.EndDate[0])).fillna(method='ffill').reset_index().rename(columns={'index': 'Date'}).drop('EndDate', axis = 1)
    new_df = pd.concat([new_df, data])

In [67]:
df = new_df.set_index('Date')

In [74]:
grouped = df.groupby([lambda x: x.year,'ArCityArCountry'])

In [75]:
grouped.sum()

                                   ID
     ArCityArCountry
2001 LosAngelesUnitedState    60832.0
     ParisFrance             700858.0
2002 ParisFrance            1005136.0
2003 ParisFrance             764656.0
2004 ParisFrance             703452.0
2005 ParisFrance             701530.0
2006 ParisFrance             701530.0
2007 ParisFrance             701530.0
2008 ParisFrance             194122.0
2009 ParisFrance            1065299.0
2010 ParisFrance            1102665.0
2011 ParisFrance             102714.0